# print("hello world")
# 面向对象的高级解释性编程语言，强类型的动态脚本语言

# 缩进错误： 1.例子为print顶格写
# 2.Syntax为语法问题   如：两个print不能写在同一行，print单独写一行
# 3.name命名问题  字符串必须要加单引号或双引号 单引号和双引号作用相同


#多行注释就是用三引号包含,可以是三队单引号,也可以是三对双引号,三引号里面的内容也不会被程序热行
#Ctr1+/即可以添加注释,也可以取消注释,使用的是单行注释
# Ctrl+Z 撤销
# Ctr1+C 复制
# Ctrl+V 粘贴
# Ctr1+F 查找
# Ctrl+D 复制到下一行

# 5.输出函数print()
#*values 值,表示可以一次输出多个对象。输出多个对象时,需要用,分隔。
# print("哈哈哈",'嘻嘻嘻',"嘿嘿",sep=',')
# 输出多个值或者多句话时,需要用,隔开,英文模式下的,
# sep就是用来间隔多个值,默认是空格
#end 用来设定以 ... 结尾,默认值是换行符\n,可以切换成其他字符串
# print("hello",end="1")
# print("binding")
#print(字符串,end="后面拼接的值”)最后输出结果:第一个print中的字符串+后面拼接的值+第二个print中的字符串

# 变量：同一个变量可以被反复赋值,并且可以是不同的数据类型

# 标识符规定:
# 1.只能由数字、字母、_(下划线)组成
# Python3可以用中文命名,但是不推荐,不符合代码的规范性
# 标识符被包含在()内对标识符本身没有影响
# 2.不能以数字开头
# 3. 不能是关键字
# 4.严格区分大小写


# 命名规范：
# 1. 见名知义
# 2. 下划线分割法:
# 多个单词组成的名称,使用小写字母,单词与单词之间使用下划线分开。
# 3.大驼峰命名法:
# 多个单词组成的名称,每个单词的首字母大写,其余字母小写。
# 4. 小驼峰命名法:
# 第一个单词首字母小写,后面单词首字母大写,其余字母小写。

# 数值类型：
# int整型(常用):任意大小的整数
# num = -5
## 检测数据类型的方法 type()
# print (type(num))
# float浮点型:小数
# num2 = 1.5
# print(type(num2))
# bool布尔型(重点),通常用于判断
#有固定写法,一个为True(真),一个为Falsq(假)
#注意:True和False必须严格区分大小写
# print(type(ture)) 报错
# 布尔值可以当作整型对待,True相当于整数1,False相当于整数0
# print (True + False) # 1 + 0 = 1
# print (True + 1)

# complex复数型(了解)
#固定写法:z=a+bj --- a是实部,b是虚部,j是虚数单位
# print(type(2+3j))
# ma = 1+2i
# print (ma) #报错,j是固定的叙述单位,不能随意改变
# ma = 1 + 2j
# ma2 = 2 + 3j
# print (ma+ma2) # (1+2)+(2j+3j)

# 4. 字符串str
#特点:需要加上引号,单引号和双引号都可以,包含了多行内容的时候也可以使用三引号
# name = sixstar
#报错,没有引号识别成变量名,sixstar没有被赋值
# name = 'sixstar'
# name = "sixstar"
# name = """sixstar
# 哈哈哈"""

"""我是注释,不会被执行
print (1234)"""
#注意多行注释和用三引号的字符串类型的区别,多行注释是单独存在的,前面不需要 变量名=
# print(name)


# 5. 格式化输出
#5.1占位符
#生成一定格式的字符串
# 5.2%
# 1. %s 字符串(常用)
# name = 'bingbing'
# print("我的名字:%s”% name)
#注意:占位符只是占据位置,并不会被输出
#%d 整数(常用)
# age = 18
# name = 'bingbing'
# print("我的名字:%s,年龄:%d"%(name,age))
# %4d 整数
#数字设置位数,不足前面补空白
# a = 123
# print("%06d"%a)
# 表示输出的整数显示位数,不足的话用0补全,超出当前位数则原样输出

#4.%f 浮点数(常用)
# a = 1.2345673
# print ("%f" % a)
#默认后六位小数,遵循四舍五入原则
#5.%.4f 浮点数
#数字设置小数位数,遵循四舍五入原则
# b= 2.34567
# print("%.7f"% b)#默认显示及7位小数

# 6.%%
# print("我是%%的1%%"%())


#5.3f格式化
#格式:f"{表达式}”
# name = 'bingbing'
# age =18
# print(f"我的名字是{name},我今年{age}岁了")








