# 1.算数运算符
#注意:使用算术运算符/,商一定是浮点数,且除数不能为0

# //为取整除 取商的整数部分,向下取整

# 向下取整:不管四舍五入的规则,只要后面有小数,就忽略小数

# % 为取余数 只取余数部分

# ** 为幂 m ** n:m的n次方

# 使用算术运算符,其中若有浮点数,结果也会用浮点数表示

#优先级排序:幂(最高优先级)>乘、除、取余、取整除>加减

# 2.输入函数（input）
# input(prompt) prompt是提示,会在控制台中显示

name = input("Enter your name: ")
print(name)

# 3.转义字符
# \t 制表符 通常表示空四个字符,也称缩进
# print (' sixs\tar')
# print("姓名\t年龄\t电话”)
#  \n 换行符 表示将当前位置移到下一行开头
# print(’哈哈\n嘻嘻’)
# \r 回车 表示将当前位置移到本行开头
# print("sixrsdhdfh")
# \\ 反斜杠符号
print(r'sixs\\\tar')#r原生字符串,默认取消转义
